class Commerce {

List<String> color = [
  "قرمز",
  "سبز",
  "آبی",
  "زرد",
  "بنفش",
  "فیروزه ای",
  "سفید",
  "سیاه",
  "قهوه ای",
  "نارنجی",
  "صورتی",
  "خاکستری",
  "خرمایی",
  "آبی آسمانی",
  "ارغوانی",
  "زیتونی",
  "نیلی",
  "طلایی",
  "لاجوردی",
  "نقره ای"
];

List<String> department = [
  "کتاب ها",
  "فیلم ها",
  "موزیک",
  "بازی ها",
  "الکترونیک",
  "رایانه",
  "خانه",
  "باغ",
  "ابزار",
  "خواربار",
  "سلامتی",
  "زیبایی",
  "اسباب بازی",
  "بچه ها",
  "بچه",
  "تن پوش",
  "کفش",
  "زیور آلات",
  "ورزش ها",
  "بیرون از خانه",
  "اتومبیل",
  "صنعتی"
];

Map<String, dynamic> productName = {
  "adjective": [
    "کوچک",
    "ارگونومیک",
    "باهوش",
    "جذاب",
    "باور نکردنی",
    "خارق العاده",
    "کاربردی",
    "براق",
    "عالی",
    "معمولی",
    "دست ساز",
    "لطیف",
    "بدون محدودیت",
    "خوش طعم"
  ],
  "material": [
    "استیل",
    "چوبی",
    "بتنی",
    "پلاستیکی",
    "کتان",
    "گرانیتی",
    "فلزی",
    "نرم",
    "تازه",
    "یخ زده"
  ],
  "product": [
    "صندلی",
    "ماشین",
    "کامپیوتر",
    "کیبورد",
    "ماوس",
    "دوچرخه",
    "توپ",
    "دستکش",
    "شلوار",
    "پیراهن",
    "میز",
    "کفش",
    "کلاه",
    "حوله",
    "صابون",
    "تن ماهی",
    "مرغ",
    "ماهی",
    "پنیر",
    "بیکن",
    "پیتزا",
    "سالاد",
    "سوسیس",
    "چیپس"
  ]
};

}