class Date {

Map<String, dynamic> month = {
  "wide": [
    "فروردین",
    "اردیبهشت",
    "خرداد",
    "تیر",
    "مرداد",
    "شهریور",
    "مهر",
    "آبان",
    "آذر",
    "دی",
    "بهمن",
    "اسفند"
  ],
  "wide_context": [
    "فروردین",
    "اردیبهشت",
    "خرداد",
    "تیر",
    "مرداد",
    "شهریور",
    "مهر",
    "آبان",
    "آذر",
    "دی",
    "بهمن",
    "اسفند"
  ],
  "abbr": [
    "فرو",
    "ارد",
    "خرد",
    "تیر",
    "مرد",
    "شهر",
    "مهر",
    "آبا",
    "آذر",
    "دی",
    "بهم",
    "اسف"
  ],
  "abbr_context": [
    "فرو",
    "ارد",
    "خرد",
    "تیر",
    "مرد",
    "شهر",
    "مهر",
    "آبا",
    "آذر",
    "دی",
    "بهم",
    "اسف"
  ]
};

// Source: http://unicode.org/cldr/trac/browser/tags/release-27/common/main/en.xml#L1847
Map<String, dynamic> weekday = {
  "wide": [
    "شنبه",
    "یکشنبه",
    "دوشنبه",
    "سه شنبه",
    "چهارشنبه",
    "پتچشنبه",
    "جمعه"
  ],
  "wide_context": [
    "شنبه",
    "یکشنبه",
    "دوشنبه",
    "سه شنبه",
    "چهارشنبه",
    "پتچشنبه",
    "جمعه"
  ],
  "abbr": [
    "ش",
    "ی",
    "د",
    "س",
    "چ",
    "پ",
    "ج"
  ],
  "abbr_context": [
    "ش",
    "ی",
    "د",
    "س",
    "چ",
    "پ",
    "ج"
  ]
};

}