class Vehicle {

List<String> fuel = [
  "دیزل",
  "الکتریکی",
  "بنزین",
  "هیبرید"
];

List<String> manufacturer = [
  "شورولت",
  "کادیلاک",
  "فورد",
  "کرایسلر",
  "دوج",
  "جیپ",
  "تسلا",
  "تویوتا",
  "هوندا",
  "نیسان",
  "آٔ‌ئودی",
  "مرسدس بنز",
  "بی ام و",
  "ولکس واگن",
  "پورشه",
  "جگوار",
  "استون مارتین",
  "لندرور",
  "بنتلی",
  "مینی",
  "رولز رویس",
  "فیات",
  "لامبورگینی",
  "مازراتی",
  "فراری",
  "بوگاتی",
  "کیا",
  "هیوندای"
];

List<String> model = [
  "فیستا",
  "فوکوس",
  "تاروس",
  "موستانگ",
  "اکسپلورر",
  "کروز",
  "مالیبو",
  "ایمپالا",
  "کامارو",
  "کروت",
  "کولورادو",
  "سیلورادو",
  "اسکالید",
  "آلپاین",
  "چارجر",
  "چلنجر",
  "رانگلر",
  "گرند چروکی",
  "رودستر",
  "کمری",
  "پریوس",
  "لندکروزر",
  "آکورد",
  "سیویک",
  "المنت",
  "سنترا",
  "آلتیما",
  "یبتل",
  "جتا",
  "گلف",
  "911",
  "اسپایدر",
  "کونتاچ",
  "مورسیه لاگو",
  "اونتادور",
];

List<String> vehicleType = [
  "ون",
  "کوپه",
  "پیکاپ",
  "مینی ون",
  "ون مسافرتی",
  "شاسی بلند",
  "سدان",
  "استیشن"
];

}