class Commerce {

List<String> color = [
  "κοκκικο",
  "πράσινο",
  "μπλε",
  "κίτρινο",
  "μωβ",
  "λευκό",
  "μαύρο",
  "πορτοκαλί",
  "ροζ",
  "γκρί",
  "βιολετί",
  "τρικουάζ",
  "λαδί",
  "χρυσό",
  "φουξια",
  "κυανό",
  "ασημί"
];

List<String> department = [
  "Βιβλία",
  "Ταινίες",
  "Μουσική",
  "Παιχνίδια",
  "Ηλεκτρονικές Συσκευές",
  "Υπολογιστές",
  "Σπίτι",
  "Κήπος",
  "Εργαλεία",
  "Grocery",
  "Υγεία",
  "Ομορφιά",
  "Παιχνίδια",
  "Παιδί",
  "Μωρό",
  "Ρουχισμός",
  "Παπούτσια",
  "Κοσμήματα",
  "Sports",
  "Εξοχή",
  "Αυτοκίνητο",
  "Βιομηχανικά"
];

Map<String, dynamic> productName = {
  "adjective": [
    "Μικρό",
    "Εργονομικό",
    "Αγροτικό",
    "Απίστευτο",
    "Φανταστικό",
    "Πρακτικό",
    "Κομψό",
    "Χειροποίητα",
    "Χειροποίητο",
    "Άδεια"
  ],
  "material": [
    "Ξύλινο",
    "Πλαστικό",
    "Μέταλο",
    "Φρέσκο",
    "Κατεψυγμένο"
  ],
  "product": [
    "Καρέκλα",
    "Αυτοκίνητο",
    "Υπολογιστής",
    "Πληκτρολόγιο",
    "Ποντίκι",
    "Ποδήλατο",
    "Μπάλα",
    "Γάντια",
    "Παντελόνι",
    "Πουκάμισο",
    "Τραπέζι",
    "Παπούτσια",
    "Καπέλο",
    "Πετσέτες",
    "Σαπούνι",
    "Τόνος",
    "Κοτόπουλο",
    "Ωάρι",
    "Τυρί",
    "Pizza",
    "Σαλάτα",
    "Λουκάνικα"
  ]
};

}