class Hacker {

List<String> abbreviation = [
  "TCP",
  "HTTP",
  "SDD",
  "RAM",
  "GB",
  "CSS",
  "SSL",
  "AGP",
  "SQL",
  "FTP",
  "PCI",
  "AI",
  "ADP",
  "RSS",
  "XML",
  "EXE",
  "COM",
  "HDD",
  "THX",
  "SMTP",
  "SMS",
  "USB",
  "PNG",
  "SAS",
  "IB",
  "SCSI",
  "JSON",
  "XSS",
  "JBOD"
];

List<String> adjective = [
  "οδηγός",
  "πρωτογενής",
  "ψηφιακή",
  "ανοιχτή πηγή",
  "εικονική",
  "ασύρματο",
  "1080p",
  "οπτική",
  "κινητό"
];

List<String> noun = [
  "οδηγός",
  "πρωτόκολο",
  "ταχύτητα",
  "panel",
  "μικρότσιπ",
  "πρόγραμμα",
  "πόρτα",
  "κάρτα",
  "διεπαφή",
  "σύστημα",
  "σένσορας",
  "ασφάλεια",
  "σκληρός δίσκος",
  "feed",
  "οθόνη",
  "εφαρμογή",
  "δίαυλος",
  "διάγραμμα",
  "πυκνωτής",
  "πίνακας"
];

List<String> verb = [
  "back up",
  "bypass",
  "hack",
  "προσπέραση",
  "συμπίεση",
  "αντιγραφή",
  "περιήγηση",
  "σύνδεση",
  "υπολογισμός",
  "είσοδος",
  "μεταφορά",
  "πρόγραμμα",
  "επανεκκίνηση",
  "προσπέλαση"
];

}