class Date {

Map<String, dynamic> month = {
  "wide": [
    "Հունվար",
    "Փետրվար",
    "Մարտ",
    "Ապրիլ",
    "Մայիս",
    "Հունիս",
    "Հուլիս",
    "Օգոստոս",
    "Սեպտեմբեր",
    "Հոկտեմբեր",
    "Նոյեմբեր",
    "Դեկտեմբեր"
  ],
  "abbr": [
    "Հնվ",
    "Փտր",
    "Մրտ",
    "Ապր",
    "Մյս",
    "Հնս",
    "Հլս",
    "Օգս",
    "Սպտ",
    "Հկտ",
    "Նմբ",
    "Դկտ"
  ],
};

Map<String, dynamic> weekday = {
  "wide": [
    "Կիրակի",
    "Երկուշաբթի",
    "Երեքշաբթի",
    "Չորեքշաբթի",
    "Հինգշաբթի",
    "Ուրբաթ",
    "Շաբաթ"
  ],

  "abbr": [
    "կրկ",
    "երկ",
    "երք",
    "չրք",
    "հնգ",
    "ուրբ",
    "շբթ"
  ],
};

}